RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_lpcomp.h
/***************************************************************************//**
* \file cy_lpcomp.h
* \version 1.40
*
*  This file provides constants and parameter values for the Low Power Comparator driver.
*
********************************************************************************
* \copyright
* (c) (2016-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
*
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_lpcomp
* \{
* Provides access to low-power comparators implemented using the fixed-function,
* LP comparator block that is present in the CAT1A and CAT1D devices.
*
* The functions and other declarations used in this driver are in the cy_lpcomp.h file.
* You can include the cy_pdl.h to get access to all functions
* and declarations in the PDL.
*
* Such comparators can perform a fast analog signal comparison of internal
* and external analog signals in all system power modes. The low-power comparator
* output can be inspected by the CPU, used as an interrupt/wakeup source to the
* CPU in Low-power mode (Sleep, Low-power Sleep or Deep-Sleep), used as
* a wakeup source to system resources in Hibernate mode, or fed to DSI as
* an asynchronous or synchronous signal (level or pulse).
*
* \section group_lpcomp_section_Configuration_Considerations Configuration Considerations
* To set up a low-power comparator, the inputs, output, mode, interrupts and
* the other configuration parameters are configured. Power the low-power comparator
* to start it operate.
*
* The sequence recommended for the low-power comparator operation:
*
* 1) To initialize the driver, call the  Cy_LPComp_Init() function providing
* the filled cy_stc_lpcomp_config_t structure, the low-power comparator
* channel number and the low-power comparator registers structure pointer.
*
* 2) Optionally, configure the interrupt requests if the interrupt event
* triggering is needed. Use the Cy_LPComp_SetInterruptMask() function with
* the parameter for the mask available in the configuration file.
* Additionally, enable the Global interrupts and initialize the referenced
* interrupt by setting the priority and the interrupt vector using
* the \ref Cy_SysInt_Init() function of the sysint driver.
*
* 3) Configure the inputs and the output using the \ref Cy_GPIO_Pin_Init()
* functions of the GPIO driver.
* High Impedance Analog drive mode is for the inputs and
* Strong drive mode - for the output.
* Use the Cy_LPComp_SetInputs() function to connect the comparator inputs
* to the dedicated IO pins, AMUXBUSA/AMUXBUSB or Vref:
* \image html lpcomp_inputs.png
*
* 4) Power on the comparator using the Cy_LPComp_Enable() function.
*
* 5) The comparator output can be monitored using
* the Cy_LPComp_GetCompare() function or using the low-power comparator
* interrupt (if the interrupt is enabled).
*
* \note The interrupt is not cleared automatically.
* It is the user's responsibility to do that.
* The interrupt is cleared by writing "1" in the corresponding interrupt
* register bit position. The preferred way to clear interrupt sources
* is using the Cy_LPComp_ClearInterrupt() function.
*
* \note Individual comparator interrupt outputs are ORed together
* as a single asynchronous interrupt source before it is sent out and
* used to wake up the system in the low-power mode.
* For CAT1A, CAT1D devices, the individual comparator interrupt is masked
* by the INTR_MASK register. The masked result is captured in
* the INTR_MASKED register.
* Writing "1" to the INTR register bit will clear the interrupt.
*
* \section group_lpcomp_lp Low Power Support
* The low-power comparator provides callback functions to facilitate
* the low-power mode transition.
* Call \ref Cy_LPComp_DeepSleepCallback during execution of
* \ref Cy_SysPm_CpuEnterDeepSleep.
* Call \ref Cy_LPComp_HibernateCallback during execution of
* \ref Cy_SysPm_SystemEnterHibernate.
* To trigger callback execution, register the callback before calling
* the mode transition function.
* Refer to \ref group_syspm driver for more
* information about low-power mode transition.
*
* The example below shows the entering Hibernate mode.
* The positive low-power comparator input connects to the dedicated GPIO pin
* and the negative low-power comparator input connects to the local reference.
* The LED blinks twice after a device reset and goes into Hibernate mode.
* When the voltage on the positive input is greater than the local reference
* voltage (0.45V - 0.75V), the device wakes up and the LED starts blinking.
* \snippet lpcomp/snippet/main.c LP_COMP_CFG_HIBERNATE
*
* \section group_lpcomp_more_information More Information
*
* For a detailed description of the registers, refer to
* the appropriate device technical reference manual (TRM).
*
* \section group_lpcomp_Changelog Changelog
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.40</td>
*     <td>Introduced an extended versions of the existing functions with
*         a pointer to the context structure allocated by the user:
*         * \ref Cy_LPComp_Init_Ext(),
*         * \ref Cy_LPComp_Enable_Ext(),
*         * \ref Cy_LPComp_Disable_Ext(),
*         * \ref Cy_LPComp_SetInterruptTriggerMode_Ext(),
*         * \ref Cy_LPComp_SetPower_Ext()
*     </td>
*     <td>Improve thread safe implementation of the PDL.</td>
*   </tr>
*   <tr>
*     <td>1.30</td>
*     <td>Fixed/documented MISRA 2012 violations.</td>
*     <td>MISRA 2012 compliance.</td>
*   </tr>
*   <tr>
*     <td>1.20.1</td>
*     <td>Minor documentation updates.</td>
*     <td>Documentation enhancement.</td>
*   </tr>
*   <tr>
*     <td rowspan="2">1.20</td>
*     <td>Flattened the organization of the driver source code into the single
*         source directory and the single include directory.
*     </td>
*     <td>Driver library directory-structure simplification.</td>
*   </tr>
*   <tr>
*     <td>Added register access layer. Use register access macros instead
*         of direct register access using de-referenced pointers.</td>
*     <td>Makes register access device-independent, so that the PDL does
*         not need to be recompiled for each supported part number.</td>
*   </tr>
*   <tr>
*     <td>1.10.1</td>
*     <td>Added Low Power Callback section</td>
*     <td>Documentation update and clarification</td>
*   </tr>
*   <tr>
*     <td>1.10</td>
*     <td>The CY_WEAK keyword is removed from Cy_LPComp_DeepSleepCallback()
*         and Cy_LPComp_HibernateCallback() functions<br>
*         Added input parameter validation to the API functions.</td>
*     <td></td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*
* \defgroup group_lpcomp_macros Macros
* \defgroup group_lpcomp_functions Functions
*   \{
*       \defgroup group_lpcomp_functions_syspm_callback  Low Power Callback
*   \}
* \defgroup group_lpcomp_data_structures Data Structures
* \defgroup group_lpcomp_enums Enumerated Types
*/

#ifndef CY_LPCOMP_PDL_H
#define CY_LPCOMP_PDL_H

/******************************************************************************/
/* Include files                                                              */
/******************************************************************************/

