RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_lpcomp.h
/** The low-power comparator inputs. */
typedef enum
{
    CY_LPCOMP_SW_GPIO       = 0x01u,  /**< The low-power comparator input connects to GPIO pin. */
    CY_LPCOMP_SW_AMUXBUSA   = 0x02u,  /**< The low-power comparator input connects to AMUXBUSA. */
    CY_LPCOMP_SW_AMUXBUSB   = 0x04u,  /**< The low-power comparator input connects to AMUXBUSB. */
    CY_LPCOMP_SW_LOCAL_VREF = 0x08u   /**< The low-power comparator input connects to local VREF. */
} cy_en_lpcomp_inputs_t;

/** The low-power comparator error codes. */
typedef enum
{
    CY_LPCOMP_SUCCESS = 0x00u,                                            /**< Successful */
    CY_LPCOMP_BAD_PARAM = CY_LPCOMP_ID | CY_PDL_STATUS_ERROR | 0x01u,     /**< One or more invalid parameters */
} cy_en_lpcomp_status_t;

#if defined (CY_IP_MXS22LPCOMP)
/** The low-power comparator trim polarity. */
typedef enum
{
   CY_LPCOMP_TRIM_NEGATIVE = 0x00U,   /**< The low-power comparator trim is negative. */
   CY_LPCOMP_TRIM_POSITIVE = 0x01U,   /**< The low-power comparator trim is positive. */
} cy_en_lpcomp_trim_polarity_t;

/** The low-power comparator trim magnitude. */
typedef enum
{
    CY_LPCOMP_TRIM_0mV  = 0x00U,   /**< The low-power comparator trim value 0mV. */
    CY_LPCOMP_TRIM_1mV  = 0x01U,   /**< The low-power comparator trim value 1mV. */
    CY_LPCOMP_TRIM_2mV  = 0x02U,   /**< The low-power comparator trim value 2mV. */
    CY_LPCOMP_TRIM_3mV  = 0x03U,   /**< The low-power comparator trim value 3mV. */
    CY_LPCOMP_TRIM_4mV  = 0x04U,   /**< The low-power comparator trim value 4mV. */
    CY_LPCOMP_TRIM_5mV  = 0x05U,   /**< The low-power comparator trim value 5mV. */
    CY_LPCOMP_TRIM_6mV  = 0x06U,   /**< The low-power comparator trim value 6mV. */
    CY_LPCOMP_TRIM_7mV  = 0x07U,   /**< The low-power comparator trim value 7mV. */
    CY_LPCOMP_TRIM_8mV  = 0x08U,   /**< The low-power comparator trim value 8mV. */
    CY_LPCOMP_TRIM_9mV  = 0x09U,   /**< The low-power comparator trim value 9mV. */
    CY_LPCOMP_TRIM_10mV = 0x0AU,   /**< The low-power comparator trim value 10mV. */
    CY_LPCOMP_TRIM_11mV = 0x0BU,   /**< The low-power comparator trim value 11mV. */
    CY_LPCOMP_TRIM_12mV = 0x0CU,   /**< The low-power comparator trim value 12mV. */
    CY_LPCOMP_TRIM_13mV = 0x0DU,   /**< The low-power comparator trim value 13mV. */
    CY_LPCOMP_TRIM_14mV = 0x0EU,   /**< The low-power comparator trim value 14mV. */
    CY_LPCOMP_TRIM_15mV = 0x0FU    /**< The low-power comparator trim value 15mV. */
} cy_en_lpcomp_trim_magnitude_t;
#endif

/** \} group_lpcomp_enums */

/**
* \addtogroup group_lpcomp_data_structures
* \{
*/

/******************************************************************************
 * Structures
 *****************************************************************************/

/** The low-power comparator configuration structure. */
typedef struct {
    cy_en_lpcomp_out_t  outputMode;  /**< The low-power comparator outputMode: Direct output,
                                       Synchronized output or Pulse output */
    cy_en_lpcomp_hyst_t hysteresis;  /**< Enables or disables the low-power comparator hysteresis */
    cy_en_lpcomp_pwr_t power;        /**< Sets the low-power comparator power mode */
    cy_en_lpcomp_int_t intType;      /**< Sets the low-power comparator interrupt mode */
} cy_stc_lpcomp_config_t;

#if defined (CY_IP_MXS22LPCOMP)
/** The low-power comparator trim structure. */
typedef struct
{
    bool enable;                              /**< Enables or disables the low-power comparator trim */
    cy_en_lpcomp_trim_polarity_t polarity;    /**< Defines the low-power comparator trim polarity */
    cy_en_lpcomp_trim_magnitude_t magnitude;  /**< Defines the low-power comparator trim magnitude */
} cy_en_lpcomp_trim_t;
#endif

/** The low-power comparator context structure, used to improve thread-safe implementation of the PDL.
* It is applicable for the following functions:
* * \ref Cy_LPComp_Init_Ext(),
* * \ref Cy_LPComp_Enable_Ext(),
* * \ref Cy_LPComp_Disable_Ext(),
* * \ref Cy_LPComp_SetInterruptTriggerMode_Ext(),
* * \ref Cy_LPComp_SetPower_Ext()
 */
typedef struct {
/** \cond CONTEXT_STRUCTURE */
    cy_en_lpcomp_int_t intType[CY_LPCOMP_MAX_CHANNEL_NUM];
    cy_en_lpcomp_pwr_t power[CY_LPCOMP_MAX_CHANNEL_NUM];
/** \endcond */
} cy_stc_lpcomp_context_t;

/** \} group_lpcomp_data_structures */

/** \cond INTERNAL_MACROS */

/******************************************************************************
 * Macros
 *****************************************************************************/
#define CY_LPCOMP_IS_CHANNEL_VALID(channel)      (((channel) == CY_LPCOMP_CHANNEL_0) || \
                                                  ((channel) == CY_LPCOMP_CHANNEL_1))
#define CY_LPCOMP_IS_OUT_MODE_VALID(mode)        (((mode) == CY_LPCOMP_OUT_PULSE) || \
                                                  ((mode) == CY_LPCOMP_OUT_DIRECT) || \
                                                  ((mode) == CY_LPCOMP_OUT_SYNC))
#define CY_LPCOMP_IS_HYSTERESIS_VALID(hyst)      (((hyst) == CY_LPCOMP_HYST_ENABLE) || \
                                                  ((hyst) == CY_LPCOMP_HYST_DISABLE))
#define CY_LPCOMP_IS_INTR_MODE_VALID(intr)       (((intr) == CY_LPCOMP_INTR_DISABLE) || \
                                                  ((intr) == CY_LPCOMP_INTR_RISING) || \
                                                  ((intr) == CY_LPCOMP_INTR_FALLING) || \
                                                  ((intr) == CY_LPCOMP_INTR_BOTH))
#define CY_LPCOMP_IS_POWER_VALID(power)          (((power) == CY_LPCOMP_MODE_OFF) || \
                                                  ((power) == CY_LPCOMP_MODE_ULP) || \
                                                  ((power) == CY_LPCOMP_MODE_LP) || \
                                                  ((power) == CY_LPCOMP_MODE_NORMAL))
#define CY_LPCOMP_IS_INTR_VALID(intr)            (((intr) == CY_LPCOMP_COMP0) || \
                                                  ((intr) == CY_LPCOMP_COMP1) || \
                                                  ((intr) == (CY_LPCOMP_COMP0 | CY_LPCOMP_COMP1)))
#define CY_LPCOMP_IS_INPUT_P_VALID(input)        (((input) == CY_LPCOMP_SW_GPIO) || \
                                                  ((input) == CY_LPCOMP_SW_AMUXBUSA) || \
                                                  ((input) == CY_LPCOMP_SW_AMUXBUSB))
#define CY_LPCOMP_IS_INPUT_N_VALID(input)        (((input) == CY_LPCOMP_SW_GPIO) || \
                                                  ((input) == CY_LPCOMP_SW_AMUXBUSA) || \
                                                  ((input) == CY_LPCOMP_SW_AMUXBUSB) || \
                                                  ((input) == CY_LPCOMP_SW_LOCAL_VREF))
#if defined (CY_IP_MXS22LPCOMP)
#define CY_LPCOMP_IS_TRIM_VALID(trim)          (((((trim)->polarity) == CY_LPCOMP_TRIM_NEGATIVE) || \
                                                 (((trim)->polarity) == CY_LPCOMP_TRIM_POSITIVE)) && \
                                                ((((trim)->magnitude) >= CY_LPCOMP_TRIM_0mV) && \
                                                 (((trim)->magnitude) <= CY_LPCOMP_TRIM_15mV)))
#endif
/** \endcond */

/**
* \addtogroup group_lpcomp_functions
* \{
*/

